<a href="https://colab.research.google.com/github/Nidogeology/Portfolio/blob/master/exerc%C3%ADcio.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Coleta de Dados em Arquivo JSON (Javascript Object Notation)

In [ ]:
# -*- coding: utf-8 -*-

### <font color=red>Lembre-se , SEMPRE é necessário instalar um pacote/biblioteca do Python antes de usá-lo</font>

A instalação é realizada apenas na primeira vez, uma vez instalado, você pode atualizar (update) se necessário.

In [ ]:
import json
import pandas as pd

##### Leitura de arquivo

In [ ]:
df = pd.read_json('pessoas.json')

In [ ]:
print(df)

                   nome  idade   data_nasc  ... peso tipo_sanguineo       cor
0       Silvana Hadassa    NaN  12/06/1964  ...   50             A+  vermelho
1         Thales Kaique   27.0  10/12/1993  ...  110             B+   laranja
2          Henry Nathan   29.0  21/09/1991  ...  106            AB-     verde
3      Lorenzo Vinicius   64.0  22/10/1956  ...  100             O+  vermelho
4         Cauã Henrique   50.0       09/03  ...   83             O-  vermelho
5      Francisco Thomas   19.0  12/04/2001  ...   64            AB-     preto
6         Bianca Flávia    NaN  23/01/1949  ...   76            AB+  vermelho
7         Arthur Filipe    NaN  23/12/1987  ...   54            AB-      roxo
8   Teresinha Jaqueline    NaN  20/10/1968  ...   59            AB-  vermelho
9           Manuel Luís   50.0  12/05/1970  ...   85             A-      roxo
10        Jorge Nicolas    NaN  11/07/1968  ...   54            AB-      roxo
11        Ricardo Paulo   37.0  16/12/1983  ...   52             B+  vermelho
12      Gustavo Joaquim   61.0  07/01/1959  ...  106             A+     verde
13        Isabel Yasmin   50.0  22/06/1970  ...   53            AB+      azul
14         Daniel Lucca   21.0       22/01  ...  105             A+     verde
15    Benício Guilherme   37.0  09/02/1983  ...   95             O-   laranja
16           João Pedro    NaN  08/05/2002  ...   57             B-     preto
17        Sandra Milena   31.0  16/07/1989  ...   84            AB-     verde
18       Antonio Sérgio   49.0       15/04  ...   71             O+      azul
19        Arthur Sérgio   76.0  20/01/1944  ...   51            AB-     preto
20       Larissa Esther   37.0  10/03/1983  ...   69            AB-     verde
21         Thales Bento    NaN  18/04/1942  ...   64             A+  vermelho
22         Breno Rafael   58.0  09/01/1962  ...  108             A+     preto
23           Tiago Gael   24.0  17/07/1996  ...   58             A+      azul
24      Carolina Márcia    NaN  25/11/1959  ...   45             B-     preto
25          Levi Sérgio    NaN  21/08/1949  ...   68            AB-  vermelho
26            Juan Theo   39.0  09/11/1981  ...   77             B-     verde
27          Rafael Ryan   70.0       10/01  ...   85             O-   laranja
28          Malu Emilly   70.0  04/07/1950  ...   48             B-  vermelho
29        Alice Bárbara   78.0  09/10/1942  ...   80            AB+   laranja
30         Martin Edson   35.0       15/01  ...   59             A-   laranja
31         Danilo Jorge   38.0  25/08/1982  ...   87            AB+     preto
32        Isadora Sueli    NaN  03/07/1999  ...   88            AB+     verde
33         Maya Tatiane   27.0  27/12/1993  ...   89            AB-      roxo
34         Bruno Manuel   57.0       14/09  ...   92             O+      azul
35         Gabriel Luan   66.0  20/12/1954  ...   93            AB-  vermelho
36          Henry Elias   57.0  26/04/1963  ...  103            AB+  vermelho
37        Marcela Laura   56.0  17/11/1964  ...   79             A-     verde
38          Amanda Luna   59.0  22/12/1961  ...   55             O-   amarelo
39         Caio Ricardo    NaN  07/09/1973  ...   97             A-      roxo
40      Mariane Sabrina   52.0  27/02/1968  ...   70             A+  vermelho
41      Juliana Vanessa   37.0  27/04/1983  ...   67            AB-      roxo
42     Milena Rosângela    NaN  11/02/1989  ...   88             B+      azul
43      Osvaldo Augusto   41.0  15/04/1979  ...  107             A-     preto
44          Nathan Igor   57.0  17/10/1963  ...   91             B+  vermelho
45     Letícia Patrícia   76.0  07/11/1944  ...   64            AB-   laranja
46        Sophia Andrea   35.0  23/07/1985  ...   47            AB+   laranja
47         Aurora Lúcia   72.0  19/01/1948  ...   73             A-   amarelo
48      Bruna Teresinha   42.0  25/04/1978  ...   77             A-     verde
49         Erick Victor   52.0       08/10  ...  104             B-   laranja
50     Gabrielly Stella   39.0  16/10/1981  ...   70             A-   amarelo
51        Osvaldo Vitor   46.0  06/05/1974  ...   74             O-  vermelho
52        Alana Kamilly   33.0  12/01/1987  ...   88             B+   amarelo
53         Bryan Kaique   62.0  19/06/1958  ...  110             B-  vermelho
54      Benedito Renato   33.0  08/10/1987  ...   81             B-   laranja
55         Kaique Isaac    NaN  16/12/1971  ...  100             O+     preto
56        Luiz Benjamin   52.0  03/07/1968  ...   77            AB-     verde
57        Fábio Roberto   75.0       24/12  ...   56             A+   amarelo
58         Evelyn Julia    NaN  18/01/1978  ...   51             B+  vermelho
59       Otávio Cláudio    NaN  04/01/1988  ...   99            AB+      azul

[60 rows x 11 columns]

In [ ]:
df.head()

               nome  idade   data_nasc  ... peso tipo_sanguineo       cor
0   Silvana Hadassa    NaN  12/06/1964  ...   50             A+  vermelho
1     Thales Kaique   27.0  10/12/1993  ...  110             B+   laranja
2      Henry Nathan   29.0  21/09/1991  ...  106            AB-     verde
3  Lorenzo Vinicius   64.0  22/10/1956  ...  100             O+  vermelho
4     Cauã Henrique   50.0       09/03  ...   83             O-  vermelho

[5 rows x 11 columns]

###Contando quantos nomes estão sem idade

In [ ]:
# print(len(df[df['idade'].isnull()]))
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nome            60 non-null     object
 1   idade           45 non-null     float64
 2   data_nasc       60 non-null     object
 3   sexo            60 non-null     object
 4   signo           60 non-null     object
 5   cidade          60 non-null     object
 6   estado          60 non-null     object
 7   altura          60 non-null     object
 8   peso            60 non-null     int64
 9   tipo_sanguineo  60 non-null     object
 10  cor             60 non-null     object
dtypes: float64(1), int64(1), object(9)
memory usage: 5.3+ KB

###Contando quantos tem idade maior ou igual a 50 anos (sem contar os NaN)

In [ ]:
print(len(df[df['idade']>=50]))

23

### Contando quantas pessoas não tem ano de nascimento

In [ ]:
df2 = df.drop(df[df['data_nasc'].apply(lambda x: len(x) <10 )].index)

In [ ]:
df7 = df.drop(df[df['data_nasc'].apply(lambda x: len(x) > 9 )].index)

In [ ]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 4 to 57
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nome            8 non-null      object
 1   idade           8 non-null      float64
 2   data_nasc       8 non-null      object
 3   sexo            8 non-null      object
 4   signo           8 non-null      object
 5   cidade          8 non-null      object
 6   estado          8 non-null      object
 7   altura          8 non-null      object
 8   peso            8 non-null      int64
 9   tipo_sanguineo  8 non-null      object
 10  cor             8 non-null      object
dtypes: float64(1), int64(1), object(9)
memory usage: 768.0+ bytes

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 52 entries, 0 to 59
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nome            52 non-null     object
 1   idade           37 non-null     float64
 2   data_nasc       52 non-null     object
 3   sexo            52 non-null     object
 4   signo           52 non-null     object
 5   cidade          52 non-null     object
 6   estado          52 non-null     object
 7   altura          52 non-null     object
 8   peso            52 non-null     int64
 9   tipo_sanguineo  52 non-null     object
 10  cor             52 non-null     object
dtypes: float64(1), int64(1), object(9)
memory usage: 4.9+ KB

In [ ]:
df2['data_nasc'] = pd.to_datetime(df2['data_nasc'], format='%d/%m/%Y')

In [ ]:
print(df2['data_nasc'])
df2.info()

0    1964-06-12
1    1993-12-10
2    1991-09-21
3    1956-10-22
5    2001-04-12
6    1949-01-23
7    1987-12-23
8    1968-10-20
9    1970-05-12
10   1968-07-11
11   1983-12-16
12   1959-01-07
13   1970-06-22
15   1983-02-09
16   2002-05-08
17   1989-07-16
19   1944-01-20
20   1983-03-10
21   1942-04-18
22   1962-01-09
23   1996-07-17
24   1959-11-25
25   1949-08-21
26   1981-11-09
28   1950-07-04
29   1942-10-09
31   1982-08-25
32   1999-07-03
33   1993-12-27
35   1954-12-20
36   1963-04-26
37   1964-11-17
38   1961-12-22
39   1973-09-07
40   1968-02-27
41   1983-04-27
42   1989-02-11
43   1979-04-15
44   1963-10-17
45   1944-11-07
46   1985-07-23
47   1948-01-19
48   1978-04-25
50   1981-10-16
51   1974-05-06
52   1987-01-12
53   1958-06-19
54   1987-10-08
55   1971-12-16
56   1968-07-03
58   1978-01-18
59   1988-01-04
Name: data_nasc, dtype: datetime64[ns]
<class 'pandas.core.frame.DataFrame'>
Int64Index: 52 entries, 0 to 59
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nome            52 non-null     object
 1   idade           37 non-null     float64
 2   data_nasc       52 non-null     datetime64[ns]
 3   sexo            52 non-null     object
 4   signo           52 non-null     object
 5   cidade          52 non-null     object
 6   estado          52 non-null     object
 7   altura          52 non-null     object
 8   peso            52 non-null     int64
 9   tipo_sanguineo  52 non-null     object
 10  cor             52 non-null     object
dtypes: datetime64[ns](1), float64(1), int64(1), object(8)
memory usage: 4.9+ KB

In [ ]:
from datetime import date
import numpy as np

In [ ]:
now = date.today()
df2['now'] = pd.to_datetime(now)
df2['calculada'] = (df2['now'] - df2['data_nasc']).astype('<m8[Y]')

In [ ]:
print(df2['calculada'])

0     56.0
1     26.0
2     29.0
3     63.0
5     19.0
6     71.0
7     32.0
8     51.0
9     50.0
10    52.0
11    36.0
12    61.0
13    50.0
15    37.0
16    18.0
17    31.0
19    76.0
20    37.0
21    78.0
22    58.0
23    24.0
24    60.0
25    71.0
26    38.0
28    70.0
29    78.0
31    38.0
32    21.0
33    26.0
35    65.0
36    57.0
37    55.0
38    58.0
39    47.0
40    52.0
41    37.0
42    31.0
43    41.0
44    56.0
45    75.0
46    35.0
47    72.0
48    42.0
50    38.0
51    46.0
52    33.0
53    62.0
54    33.0
55    48.0
56    52.0
58    42.0
59    32.0
Name: calculada, dtype: float64

In [ ]:
df2['idade'] = df2['calculada']

In [ ]:
df2.head()

               nome  idade  data_nasc  ...       cor        now calculada
0   Silvana Hadassa   56.0 1964-06-12  ...  vermelho 2020-10-14      56.0
1     Thales Kaique   26.0 1993-12-10  ...   laranja 2020-10-14      26.0
2      Henry Nathan   29.0 1991-09-21  ...     verde 2020-10-14      29.0
3  Lorenzo Vinicius   63.0 1956-10-22  ...  vermelho 2020-10-14      63.0
5  Francisco Thomas   19.0 2001-04-12  ...     preto 2020-10-14      19.0

[5 rows x 13 columns]

In [ ]:
df3 = df2.drop(['now', 'calculada'], axis=1)
df3.head()

               nome  idade  data_nasc  ... peso tipo_sanguineo       cor
0   Silvana Hadassa   56.0 1964-06-12  ...   50             A+  vermelho
1     Thales Kaique   26.0 1993-12-10  ...  110             B+   laranja
2      Henry Nathan   29.0 1991-09-21  ...  106            AB-     verde
3  Lorenzo Vinicius   63.0 1956-10-22  ...  100             O+  vermelho
5  Francisco Thomas   19.0 2001-04-12  ...   64            AB-     preto

[5 rows x 11 columns]

In [ ]:
df7['data_nasc'] = pd.to_datetime(df7['data_nasc'], format='%d/%m')
df7['data_nasc']

4    1900-03-09
14   1900-01-22
18   1900-04-15
27   1900-01-10
30   1900-01-15
34   1900-09-14
49   1900-10-08
57   1900-12-24
Name: data_nasc, dtype: datetime64[ns]

In [ ]:
today = pd.to_datetime(now)
df7['calculada'] = today.year - df7['idade']
df7['calculada']

4     1970.0
14    1999.0
18    1971.0
27    1950.0
30    1985.0
34    1963.0
49    1968.0
57    1945.0
Name: calculada, dtype: float64

In [ ]:
day = (df7['data_nasc'].dt.strftime('%d'))
month = (df7['data_nasc'].dt.strftime('%m'))
year = df7['calculada']

df9 = pd.DataFrame({'DAY' : day, 'MONTH' : month,'YEAR': year})
df9['data_nova'] = pd.to_datetime(df9[['DAY', 'MONTH', 'YEAR']])

In [ ]:
print(df9['data_nova'])

4    1970-03-09
14   1999-01-22
18   1971-04-15
27   1950-01-10
30   1985-01-15
34   1963-09-14
49   1968-10-08
57   1945-12-24
Name: data_nova, dtype: datetime64[ns]

In [ ]:
df7['data_nasc'] = df9['data_nova']

df8 = df7.drop(['calculada', 'now', 'day', 'month', 'dateInt'], axis=1)
df8.head()

              nome  idade  data_nasc  ... peso tipo_sanguineo       cor
4    Cauã Henrique   50.0 1970-03-09  ...   83             O-  vermelho
14    Daniel Lucca   21.0 1999-01-22  ...  105             A+     verde
18  Antonio Sérgio   49.0 1971-04-15  ...   71             O+      azul
27     Rafael Ryan   70.0 1950-01-10  ...   85             O-   laranja
30    Martin Edson   35.0 1985-01-15  ...   59             A-   laranja

[5 rows x 11 columns]

In [ ]:
df10 = df8.append(df3)
datinha = df10
datinha.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60 entries, 4 to 59
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   nome            60 non-null     object
 1   idade           60 non-null     float64
 2   data_nasc       60 non-null     datetime64[ns]
 3   sexo            60 non-null     object
 4   signo           60 non-null     object
 5   cidade          60 non-null     object
 6   estado          60 non-null     object
 7   altura          60 non-null     object
 8   peso            60 non-null     int64
 9   tipo_sanguineo  60 non-null     object
 10  cor             60 non-null     object
dtypes: datetime64[ns](1), float64(1), int64(1), object(8)
memory usage: 5.6+ KB

In [ ]:
datinha['ano'] = pd.DatetimeIndex(datinha['data_nasc']).year
# datinha['ano']

len(datinha[datinha['ano'].apply(lambda x: 1968 <= x <= 1978)].index)

14

In [ ]:
velha = datinha.loc[datinha['data_nasc'] == datinha.data_nasc.min(), 'nome']
nova = datinha.loc[datinha['data_nasc'] == datinha.data_nasc.max(), 'nome']
print(f'A pessoa mais velha é: {velha}')
print(f'A pessoa mais nova é: {nova}')

A pessoa mais velha é: 21    Thales Bento
Name: nome, dtype: object
A pessoa mais nova é: 16    João Pedro
Name: nome, dtype: object

In [ ]:
data2 = pd.read_json('https://api-coleta-dados.herokuapp.com/api/pessoas')

In [ ]:
data2.head()

               nome  idade   data_nasc  ... peso tipo_sanguineo       cor
0   Silvana Hadassa    NaN  12/06/1964  ...   50             A+  vermelho
1     Thales Kaique   27.0  10/12/1993  ...  110             B+   laranja
2      Henry Nathan   29.0  21/09/1991  ...  106            AB-     verde
3  Lorenzo Vinicius   64.0  22/10/1956  ...  100             O+  vermelho
4     Cauã Henrique   50.0       09/03  ...   83             O-  vermelho

[5 rows x 11 columns]